package com.javarush.korotkov.gamequest.constants;

import lombok.experimental.UtilityClass;

@UtilityClass
public class WebConstants {


    public static final String GREETINGS = """
            Добро пожаловать, Нео!<br>
                       Мы следим за тобой уже давно!<br>
                       Днём ты — обычный программист, но ночью... ты становишься кем-то другим.<br>
                       Ты ищешь ответы на вопросы, которые не дают тебе покоя.<br>
                       Ты чувствуешь, что с этим миром что-то не так, но не можешь понять, что именно.<br>
                       Думаем, ты уже догадываешься... Нам пора встретиться!<br>
            """;
    public static final String CHOOSE_TABLET = """
            Матрица повсюду, она окружает нас!<br>
            Пока матрица существует - нам свободными не быть...<br><br>
            Морфеус предоставил тебе выбор:<br>
            Ты должен принять таблетку: <span style="color: red;">красную</span> или <span style="color: blue;">синюю</span>.<br><br>
            <span style="color: red;">Красная</span> таблетка - войдёшь в страну чудес и узнаешь глубока ли кроличья нора.<br>
            <span style="color: blue;">Синяя</span> таблетка - проснёшься в своей постели и поверишь, что это был сон.<br>
            """;

    public static final String WELCOME_IN_REAL_WORLD = """
            Добро пожаловать, в реальный мир, Нео!<br>
            Ты на борту Навуходоносора вместе с Морфеусом и Тринити.<br>
            Тебе придётся приспособиться к реальной жизни в этом жестоком мире:<br><br>
            <span style="color: red;">Красная</span> кнопка - Принять реальность и учиться выживать.<br>
            <span style="color: blue;">Синяя</span> кнопка - "Ой, мамочки! Хочу домой в кроватку!"<br>
            """;

    public static final String RELEASE_YOUR_MIND = """
            Морфеус пригласил тебя на виртуальную тренировку:<br><br>
            Пора освободить твой разум: страх, неверие, сомнения отбрось...<br>
            Очисть своё сознание. Бесконечность не предел...<br><br>
            <span style="color: red;">Красная</span> кнопка - "Погнали тренить!!!".<br>
            <span style="color: blue;">Синяя</span> кнопка - "Ни за что! Верните усё как было!"<br>
            """;

    public static final String GO_TO_PIFIA = """
            Поздравляю! Ты закончил своё обучение!<br>
            Пора отправляться к нашей прорицательнице Пифии!<br>
            Теперь мы выясним избранный ты или так себе...<br><br>
            <span style="color: red;">Красная</span> кнопка - "Да, конечно! Бегом к Пифии!"<br>
            <span style="color: blue;">Синяя</span> кнопка - "Нет, не надо, дядя! Я боюсь!"<br>
            """;

    public static final String SAVE_MORFIUS = """
            Внимание! Тревога!<br>
            После визита к Пифии, Агенты захватили Морфеуса!<br>
            Зеон в опасности! Все коды доступа к городу у лысого!<br>
            Бегом спасать Морфеуса!<br><br>
            <span style="color: red;">Красная</span> кнопка - "Тысяча чертей! Скорее подключай меня!"<br>
            <span style="color: blue;">Синяя</span> кнопка - "Идите лесом! Я устал, я ухожу!"<br>
            """;

    public static final String WAKE_UP_IN_BED = """
            Ты проснулся в своей кровати<br>
            и продолжаешь своё рабское существование в Матрице!<br><br>
            Что? Ты ещё здесь? Иди доживай свою жалкую жизнь!<br><br>
            !!! GAME OVER !!!<br>
            """;

    public static final String DROP_OUT_FROM_SHIP = """
            Тебя выкинули с корабля в канализацию!<br>
            Охотники разорвали тебя в клочья!<br><br>
            Трус не играет в Матрицу!<br><br>
            !!! GAME OVER !!!<br>
            """;

    public static final String VICTORY = """
            Ты спас старика Морфеуса!<br>
            Победил Агента!<br>
            Нашёл свою любовь!<br>
            И научился летать!!!<br>
            ТЫ - НЕО! ТЫ ИЗБРАННЫЙ!!!<br>
            !!! ПОБЕДА !!!
            """;

}

